# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами. 
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

lst = [1, 2, 4, 0]
new_lst = [x ** 2 for x in lst]
print(new_lst)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

friuts_lst1 = ['яблоко', 'авокадо','груша','персик']
friuts_lst2 = ['арбуз', 'дыня','груша','персик']
new_fruits_lst = [x for x in friuts_lst1 if (x in friuts_lst2)]
print(new_fruits_lst)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4
def valid_num(num):
    return num % 3 == 0 and num>=0 and num % 4 != 0

num_lst = [1,4,3,5,-1,-3,12,9,-9]
num_lst2 = [x for x in num_lst if valid_num(x)]
print(num_lst2)
