# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py

import sys, easy

com = sys.argv[1]
try:
    name = sys.argv[2]
except IndexError:
    name = ''

command = {
    'cd': easy.cd,
    'ls': easy.ls,
    'rmdir': easy.rmdir,
    'mkdir': easy.mkdir
}

if com in command:
    command[com](name) if name else command[com]()
else:
    raise("Нет такой команды")
        