import math
# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]
print("Задача-1")
lst = [2, -5, 8, 9, -25, 25, 4]
new_lst = []
for num in lst:
    if num < 0: continue # нельзя просто так взять и извлечь корень из отрицательного числа
    root = math.sqrt(num)
    if root == int(root):
        new_lst.append(root)
print(new_lst)



# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)
print("\nЗадача-2")
dt = '01.01.2020'
day, month, year = dt[0:2], dt[3:5], dt[6:]

days_dict = {
    '01':"первое",
    '02':"второе",
    '03':"третье",
    '04':"четвёртое",
    '05':"пятое",
    '06':"шестое",
    '07':"седьмое",
    '08':"восьмое",
    '09':"девятое",
    '10':"десятое",
    '11':"одиннадцатое",
    '12':"двенадцатое",
    '13':"тринадцатое",
    '14':"четырнадцатое",
    '15':"пятнадцатое",
    '16':"шестнадцатое",
    '17':"семнадцатое",
    '18':"восемнадцатое",
    '19':"девятнадцатое",
    '20':"двадцатое",
    '21':"двадцать первое",
    '22':"двадцать второе",
    '23':"двадцать третье",
    '24':"двадцать четвёртое",
    '25':"двадцать пятое",
    '26':"двадцать шестое",
    '27':"двадцать седьмое",
    '28':"двадцать восьмое",
    '29':"двадцать девятое",
    '30':"тридцатое",
    '31':"тридцать первое"
}

months_dict = {
    '01':"января",
    '02':"февраля",
    '03':"марта",
    '04':"апреля",
    '05':"мая",
    '06':"июня",
    '07':"июля",
    '08':"августа",
    '09':"сентября",
    '10':"октября",
    '11':"ноября",
    '12':"декабря"
}

print("{} {} {} года".format(days_dict[day], months_dict[month], year))

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random

print("\nЗадача-3")
n = 50
arr = []
for i in range(n):
    arr.append(random.randint(-100,100))
print(arr)

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

print("\nЗадача-4")
lst = [1, 2, 4, 5, 6, 2, 5, 2]
arr1 = []
for i in lst:
    if i not in arr1: arr1.append(i)
print(arr1)

arr2 = []
for i in lst:
    num_count = 0
    for j in lst:
        if i == j: num_count += 1
    if num_count == 1: arr2.append(i)
print(arr2)