
__author__ = 'Прытков Артём Юрьевич'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

print("Задача 1")
number = input("Введите любое число:")
max_number = 0
for n in number:
    if int(n) > max_number: 
        max_number = int(n)
print("Максимальная цифра:",max_number)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.
print("Задача 2")
a = int(input("Введите первое число для переменной a:"))
b = int(input("Введите второе число для переменной b:"))
a, b = b, a
print("Теперь в переменной a значение", a)
print("Теперь в переменной b значение", b)

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

print("Задача 3")
import math

a = int(input("Введите коэффициент a:"))
b = int(input("Введите коэффициент b:"))
c = int(input("Введите коэффициент c:"))

d = (a**2) - (4*a*c)
if d > 0:
    x1 = (-b + math.sqrt(d))/(2*a)
    x2 = (-b - math.sqrt(d))/(2*a)
    print("Корень 1:", x1)
    print("Корень 2:", x2)
elif d == 0:
    x = -b / (2 * a)
    print("Корень:", x)
else:
    print("Нет корней")